src/cf/DataProcessors/РаботаСРезультатамиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РаботаСРезультатамиОбмена</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВРегистрОбъектыКЗагрузке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбрабатываемойВерсии</Name>
					<Comment>Соответствует дате добавления в РС "Прочитанные данные сообщений обмена". Если отличается, то были прочитаны новые данные</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСконвертированногоОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбновленияОбъектаВИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбновленияОбъектаПриПроблемахЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСсылкаНаОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаФорматаЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПрочитанныеДанныеСообщенийОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрочитанныеДанныеСообщенийОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбъектаВИсточнике</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СодержимоеЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПространствоИменURI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛокальноеИмяОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КоличествоБлокируемыхОбъектовКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КоличествоБлокируемыхОбъектовКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыБлокирующиеЗагрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыБлокирующиеЗагрузку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеТипа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФорматаКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыСинхронизируемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаВнешняяНавигационная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/РаботаСРезультатамиОбмена/Forms/ФормаПроблемыОшибкаКонвертации/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьДанныеФормы();
	
	ОбработатьПереданныеПараметры(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолучитьДанныеБлокируемыеОбъекты();
	ПолучитьВозможныеТипыОбъектаМетаданныхЕслиНеобходимо();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияНавигационнойСсылки(Ключ, Представление, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НавигационнаяСсылка = НавигационнаяСсылкаФормы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПереходВКомментарийОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиВКомментарий" Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПерейтиВКомментарий(ЭтотОбъект, УзелИнформационнойБазы, ПолученныйОбъект, ОбъектФормата, ПравилоКонвертации, Комментарий);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БлокируетПредставлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуБлокируемыеОбъекты(ЭтотОбъект, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеВИБСтрокаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "УстановитьСоответствие" Тогда
		
		ПриНачалеВыбораСоответствия(Элементы.СоответствиеВИБСтрока);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьОбъектИБ" Тогда
		
		ПоказатьЗначение(, СоответствиеВИБ);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтменитьСоответствие" Тогда
		
		СоответствиеВИБ = Неопределено;
		СформироватьТекстСоответствия(ЭтотОбъект);
		УправлениеКомандамиФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РекомендацииПоРаботеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	
	СтандартнаяОбработка = Ложь;
	
	СсылкаСобытия = ДанныеСобытия.Href;
	
	Если СтрНайти(СсылкаСобытия, "ПерейтиНаСтраницуТекстОшибки") Тогда
		
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОсновное;
		ТекущийЭлемент = Элементы.ТекстОшибкиФорматированныйДокумент; 
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "ОткрытьФормуПолученныхДанных") Тогда
	
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуПолученныеДанные(ЭтотОбъект, ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелИнформационнойБазы);
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "КонвертироватьЗаново") Тогда 
		
		ЗагрузитьОбъект(Ложь);
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "ОткрытьОбъектВИсточнике") Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПерейтиПоВнешнейСсылкеНаОбъект(ВнешняяСсылкаНаОбъект, "РекомендацииПоРаботе");
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "ОткрытьОбъектИБ") Тогда
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьСоответствиеВИБ(СоответствиеВИБ, "РекомендацииПоРаботе");
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "УстановитьСоответствие") Тогда
		
		РаботаСРезультатамиОбменаКлиент.УстановитьСоответствиеВИБЕслиОтсутствует(
			ЭтотОбъект, СоответствиеВИБ, ПолноеИмяОбъектаМетаданных, "РекомендацииПоРаботе");
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "ОтклонитьЗагрузку") Тогда

		ОтклонитьЗагрузкуОбъекта();
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "БлокируемыеОбъекты") Тогда
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуБлокируемыеОбъекты(ЭтотОбъект, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы);
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "НаписатьКомментарий") Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПерейтиВКомментарий(ЭтотОбъект, УзелИнформационнойБазы, ПолученныйОбъект, ОбъектФормата, ПравилоКонвертации, Комментарий);
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "СоздатьНовый") Тогда 
		
		РаботаСРезультатамиОбменаКлиент.УстановитьСоответствиеВИБЕслиОтсутствует(
			ЭтотОбъект, СоответствиеВИБ, ПолноеИмяОбъектаМетаданных, "РекомендацииПоРаботе");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСоответствие(Команда)
	
	ПриНачалеВыбораСоответствия(Элементы.ФормаУстановитьСоответствие);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъектВИсточнике(Команда)
	
	Если ЗначениеЗаполнено(ВнешняяСсылкаНаОбъект) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ВнешняяСсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПолученныеДанные(Команда)
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуПолученныеДанные(ЭтотОбъект, ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелИнформационнойБазы);
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	ОтклонитьЗагрузкуОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура Конвертировать(Команда)
	
	ЗагрузитьОбъект(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьИОткрыть(Команда)
	
	ЗагрузитьОбъект(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияФормы

&НаСервере
Процедура ИнициализироватьДанныеФормы()
	
	РаботаСРезультатамиОбмена.ИнициализироватьДанныеФормыПроблемы(ЭтотОбъект, "РекомендацииРешениеПроблемаКонвертации"); 
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПереданныеПараметры(Отказ)
	
	Если Параметры.ДанныеЗаписиОбъектКЗагрузке = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'В форму не передана информация о проблеме.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	РаботаСРезультатамиОбмена.ЗаполнитьРеквизитыФормыПроблемыПоПараметрам(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы()

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ДатаУстановкиПричиныДобавления                КАК ДатаВозникновения,
	|	ОбъектыКЗагрузке.ВнешняяСсылкаНаОбъект                         КАК ВнешняяСсылкаНаОбъект,
	|	ОбъектыКЗагрузке.КомментарийАдминистратора                     КАК Комментарий,
	|	ОбъектыКЗагрузке.ОбъектМетаданных                              КАК ОбъектМетаданных,
	|	ОбъектыКЗагрузке.СсылкаНаОбъект                                КАК СсылкаНаОбъект,
	|	ОбъектыКЗагрузке.ПричинаДобавления                             КАК ПричинаДобавления,
	|	ПрочитанныеДанныеСообщенийОбмена.СодержимоеЗаписи              КАК СодержимоеЗаписи,
	|	ОбъектыКЗагрузке.ДатаОбрабатываемойВерсии                      КАК ДатаОбрабатываемойВерсии,
	|	ОбъектыКЗагрузке.КраткоеПредставлениеОшибки                    КАК КраткоеПредставлениеОшибки,
	|	ОбъектыКЗагрузке.ПолноеПредставлениеОшибки                     КАК ПолноеПредставлениеОшибки,
	|	ЕСТЬNULL(КоличествоБлокируемыхОбъектовКЗагрузке.Количество, 0) КАК КоличествоБлокирует
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект = ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект
	|			И ОбъектыКЗагрузке.УзелПланаОбмена = ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена
	|			И ОбъектыКЗагрузке.ОбъектФормата = ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоБлокируемыхОбъектовКЗагрузке КАК КоличествоБлокируемыхОбъектовКЗагрузке
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект = КоличествоБлокируемыхОбъектовКЗагрузке.ОбъектКПолучению
	|			И ОбъектыКЗагрузке.ОбъектФормата     = КоличествоБлокируемыхОбъектовКЗагрузке.ОбъектФормата
	|			И ОбъектыКЗагрузке.УзелПланаОбмена = КоличествоБлокируемыхОбъектовКЗагрузке.УзелПланаОбмена
	|ГДЕ
	|	ОбъектыКЗагрузке.ПолученныйОбъект = &ПолученныйОбъект
	|	И ОбъектыКЗагрузке.ПравилоКонвертации = &ПравилоКонвертации
	|	И ОбъектыКЗагрузке.ОбъектФормата = &ОбъектФормата
	|	И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелИнформационнойБазы";
	
	Запрос.УстановитьПараметр("ПолученныйОбъект",       ПолученныйОбъект);
	Запрос.УстановитьПараметр("ОбъектФормата",          ОбъектФормата);
	Запрос.УстановитьПараметр("ПравилоКонвертации",     ПравилоКонвертации);
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ВнешняяСсылкаНаОбъект          = Выборка.ВнешняяСсылкаНаОбъект;
	ПолноеПредставлениеОшибки      = Выборка.ПолноеПредставлениеОшибки;
	ПричинаДобавления              = Выборка.ПричинаДобавления;
	ДатаОбрабатываемойВерсии       = Выборка.ДатаОбрабатываемойВерсии;
	ДатаВозникновения              = Выборка.ДатаВозникновения;
	Комментарий                    = Выборка.Комментарий;
	БлокируетНепосредственно       = Выборка.КоличествоБлокирует;
	СоответствиеВИБ                = Выборка.СсылкаНаОбъект;
	
	Если ЗначениеЗаполнено(Выборка.ОбъектМетаданных) Тогда
		МетаданныеОбъекта              = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Выборка.ОбъектМетаданных);
		ПолноеИмяОбъектаМетаданных     = МетаданныеОбъекта.ПолноеИмя();
		ПредставлениеОбъектаМетаданных = Строка(Выборка.ОбъектМетаданных);
	Иначе
		Элементы.ФормаУстановитьСоответствие.Видимость = Ложь;
		Если ПустаяСтрока(ОбъектФормата) Тогда
			ПредставлениеОбъектаМетаданных = НСтр("ru = '<не определен>'");
			Элементы.ПредставлениеОбъектаМетаданных.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Иначе
			ПредставлениеОбъектаМетаданных                     = ОбъектФормата;
			Элементы.ПредставлениеОбъектаМетаданных.ЦветТекста = Новый Цвет();
		КонецЕсли;
		
	КонецЕсли;
	
	СформироватьПредставлениеБлокирует(ЭтотОбъект);
	СформироватьТекстСоответствия(ЭтотОбъект);
	УправлениеКомандамиФормы();
	
	ТекстОшибкиФорматированныйДокумент = РаботаСРезультатамиОбмена.ФорматированныйДокументИзТекстаСоСсылками(ПолноеПредставлениеОшибки);
	
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьПереходВКомментарий(Элементы.ПереходВКомментарийДекорация, Комментарий, ЦветГиперссылки, КартинкаКомментарий);
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеКомментария

&НаКлиенте
Процедура ПослеЗакрытияФормыКомментария(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Комментарий = Результат;
	
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьПереходВКомментарий(Элементы.ПереходВКомментарийДекорация, Комментарий, ЦветГиперссылки, КартинкаКомментарий);
	
КонецПроцедуры

#КонецОбласти

#Область БлокируемыеОбъекты

&НаКлиенте
Процедура ПолучитьДанныеБлокируемыеОбъекты()
	
	Если ДанныеОпосредованоПолучены
		Или БлокируетНепосредственно = 0 Тогда
		СформироватьПредставлениеБлокирует(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияБлокируемыеОбъекты(УникальныйИдентификатор);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПолучитьДанныеБлокируемыхОбъектовЗавершение(ДлительнаяОперация, Неопределено);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьДанныеБлокируемыхОбъектовЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияБлокируемыеОбъекты(УникальныйИдентификатор)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ПолученныйОбъект", ПолученныйОбъект);
	ПараметрыПроцедуры.Вставить("ОбъектФормата",    ОбъектФормата);
	ПараметрыПроцедуры.Вставить("УзелПланаОбмена",  УзелИнформационнойБазы);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение данных количества блокируемых объектов'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.ОбъектыБлокирующиеЗагрузку.ПолучитьКоличествоБлокируемыхОбъектов",
		                                                    ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеБлокируемыхОбъектовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбработатьПолученныеДанныеБлокирует(Результат.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПолученныеДанныеБлокирует(АдресРезультата)

	Если Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда 
		Возврат;
	КонецЕсли;
	
	ПолученныеДанные = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ПолученныеДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(ПолученныеДанные) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	БлокируетНепосредственно = ПолученныеДанные.БлокируетНепосредственно;
	БлокируетОпосредованно   = ПолученныеДанные.БлокируетОпосредовано;
	
	ДанныеОпосредованоПолучены = Истина;
	
	СформироватьПредставлениеБлокирует(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеБлокирует(Форма)
	
	Если Форма.БлокируетНепосредственно = 0 Тогда
		ДанныеОпосредованоПолучены = Истина;
	КонецЕсли;
	
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьПредставлениеБлокирует(
		Форма,
		Форма.БлокируетНепосредственно,
		Форма.БлокируетОпосредованно,
		Форма.ДанныеОпосредованоПолучены);
	
КонецПроцедуры

#КонецОбласти

#Область УстановкаСоответствия

&НаКлиенте
Процедура ПриНачалеВыбораСоответствия(ЭлементФормы)
	
	Если ЗначениеЗаполнено(ПолноеИмяОбъектаМетаданных) Тогда
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуВыбораОбъектаДляУстановкиСоответствия(ЭтотОбъект, ПолноеИмяОбъектаМетаданных);
		
	ИначеЕсли ВозможныеТипыОбъектовМетаданных.Количество() > 1 Тогда
		
		ПослеВыбораТипаСопоставляемогоОбъекта = Новый ОписаниеОповещения("ПослеВыбораТипаСопоставляемогоОбъекта", ЭтотОбъект);
		
		ПоказатьВыборИзМеню(ПослеВыбораТипаСопоставляемогоОбъекта, ВозможныеТипыОбъектовМетаданных, ЭлементФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТипаСопоставляемогоОбъекта(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуВыбораОбъектаДляУстановкиСоответствия(ЭтотОбъект, Результат.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВозможныеТипыОбъектаМетаданныхЕслиНеобходимо()

	Если Не ПустаяСтрока(ПолноеИмяОбъектаМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияВозможныеТипыОбъектовМетаданных(УникальныйИдентификатор);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПолучитьВозможныеТипыОбъектаМетаданныхЗавершение(ДлительнаяОперация, Неопределено);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьВозможныеТипыОбъектаМетаданныхЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВозможныеТипыОбъектовМетаданных(УникальныйИдентификатор)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	ПараметрыПроцедуры.Вставить("ИмяОбъектаФормата",      ОбъектФормата);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение возможных типов объектов метаданных по имени объекта формата'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("Обработки.РаботаСРезультатамиОбмена.ПолучитьВозможныеТипыОбъектаМетаданных",
	                                                       ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьВозможныеТипыОбъектаМетаданныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбработатьПолученныеВозможныеТипыОбъектовМетаданных(Результат.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПолученныеВозможныеТипыОбъектовМетаданных(АдресРезультата)
	
	Если Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда 
		Возврат;
	КонецЕсли;
	
	ПолученныеДанные = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ПолученныеДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(ПолученныеДанные) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВозможныйТип Из ПолученныеДанные Цикл
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ВозможныйТип);
		Если ОбъектМетаданных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВозможныеТипыОбъектовМетаданных.Добавить(ОбъектМетаданных.ПолноеИмя(), 
		                                         Строка(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных)));
		
	КонецЦикла;
	
	Если ВозможныеТипыОбъектовМетаданных.Количество() = 1 Тогда
		ПолноеИмяОбъектаМетаданных = ВозможныеТипыОбъектовМетаданных[0].Значение;
	КонецЕсли;
	
	СформироватьТекстСоответствия(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРучногоВыбораСоответствияИБ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Действие = "ВопросЕслиСоответствиеЕсть" Тогда
		
		УжеСопоставленныеИдентификаторы = РезультатПроверкиВыбранногоСоответствия(Результат);
		
		Если УжеСопоставленныеИдентификаторы.Количество() > 0 Тогда
			
			РаботаСРезультатамиОбменаКлиент.ОткрытьФормуСоответствиеУжеУстановлено(ЭтотОбъект,
			                                                                       Результат,
			                                                                       УжеСопоставленныеИдентификаторы,
			                                                                       ДополнительныеПараметры,
			                                                                       УзелИнформационнойБазы);
			
		Иначе
			
			ОтразитьУстановленноеСоответствие(Результат);
			
		КонецЕсли;
			
	ИначеЕсли ДополнительныеПараметры.Действие = "УстановитьСоответствие" Тогда
		
		ОтразитьУстановленноеСоответствие(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьУстановленноеСоответствие(ВыбранныйОбъект)
	
	СоответствиеВИБ                   = ВыбранныйОбъект;
	СоответствиеУстановленоВЭтойФорме = Истина;
	
	СформироватьТекстСоответствия(ЭтотОбъект);
	УправлениеКомандамиФормы();
	
КонецПроцедуры

&НаСервере
Функция РезультатПроверкиВыбранногоСоответствия(ВыбранныйОбъект)
	
	ДанныеПроверкиПИСО = Новый Структура;
	ДанныеПроверкиПИСО.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	ДанныеПроверкиПИСО.Вставить("Ссылка",                 ВыбранныйОбъект);
	
	Возврат РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПубличныеИдентификаторыПриложенияСоответствующиеСсылке(ДанныеПроверкиПИСО);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьТекстСоответствия(Форма)
	
	ПараметрыФормирования = РаботаСРезультатамиОбменаКлиентСервер.НовыйПараметрыФормированияТекстаСоответствияВФормеПроблемы();
	ПараметрыФормирования.СоответствиеУстановленоВЭтойФорме = Форма.СоответствиеУстановленоВЭтойФорме;
	ПараметрыФормирования.ЦветГиперссылки                   = Форма.ЦветГиперссылки;
	ПараметрыФормирования.ВыборСоответствияДоступен         = Не ПустаяСтрока(Форма.ПолноеИмяОбъектаМетаданных)
	                                                          Или Форма.ВозможныеТипыОбъектовМетаданных.Количество() > 0;
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьТекстСоответствияВФормеПроблемы(Форма, ПараметрыФормирования);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаСервере
Процедура УправлениеКомандамиФормы()
	
	Если ЗначениеЗаполнено(СоответствиеВИБ) Тогда
		
		Элементы.ФормаУстановитьСоответствие.Видимость   = Ложь;
		Элементы.ФормаОтклонить.Видимость               = Ложь;
		Элементы.ОтклонитьТекст.Видимость               = Истина;
		Команды.Отклонить.Отображение                   =  ОтображениеКнопки.КартинкаИТекст;
		
	Иначе
		
		Элементы.ФормаУстановитьСоответствие.Видимость   = Истина;
		Элементы.ФормаОтклонить.Видимость               = Истина;
		Элементы.ОтклонитьТекст.Видимость               = Ложь;
		Команды.Отклонить.Отображение                   =  ОтображениеКнопки.Картинка;
		
	КонецЕсли;
	
	Элементы.ФормаОткрытьОбъектВИсточнике.Видимость = Не ПустаяСтрока(ВнешняяСсылкаНаОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОтклонениеЗагрузки

&НаСервере
Функция РезультатУстановкиПричиныЗагрузкаОтклонена(ДанныеОбъектаКОбработке)
	
	Возврат РаботаСРезультатамиОбмена.РезультатУстановкиПричиныЗагрузкаОтклоненаВФормеПроблемы(ДанныеОбъектаКОбработке);
	
КонецФункции

&НаКлиенте
Процедура ОтклонитьЗагрузкуОбъекта()
	
	ОчиститьСообщения();
	
	ДанныеОбъектаКОбработке = РаботаСРезультатамиОбменаКлиент.ДанныеПроблемыКОбработкеПоДаннымФормы(ЭтотОбъект);
	
	РезультатИзмененияПричины = РезультатУстановкиПричиныЗагрузкаОтклонена(ДанныеОбъектаКОбработке);
	
	Если Не РезультатИзмененияПричины.Успешно Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатИзмененияПричины.ТекстОшибки);
		
	Иначе
		
		Оповестить("Запись_ПричинаДобавленияОбъектыКЗагрузке");
		
		Если РезультатИзмененияПричины.УстановленоСоответствие Тогда 
			
			ДанныеВозврата = РаботаСРезультатамиОбменаКлиент.НовыйРезультатОбработкиВФормеПроблемы();
			ДанныеВозврата.ПолученныйОбъект             = ПолученныйОбъект;
			ДанныеВозврата.ПравилоКонвертации           = ПравилоКонвертации;
			ДанныеВозврата.ОбъектФормата                = ОбъектФормата;
			ДанныеВозврата.УстановленоСоответствие      = Истина;
			ДанныеВозврата.ИдентификаторФоновогоЗадания = РезультатИзмененияПричины.ИдентификаторФоновогоЗадания;
			
			Закрыть(ДанныеВозврата);
			
		Иначе
			
			Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗагрузитьОбъект(ОткрытьОбъектПослеЗагрузки)
	
	ОчиститьСообщения();
	
	ДанныеОбъектаКОбработке = РаботаСРезультатамиОбменаКлиент.ДанныеПроблемыКОбработкеПоДаннымФормы(ЭтотОбъект);
	
	РезультатЗагрузкиОбъекта = РезультатЗагрузкиОбъекта(ДанныеОбъектаКОбработке);
	
	Если Не РезультатЗагрузкиОбъекта.Успешно Тогда
		
		Для Каждого ТекстОшибки Из РезультатЗагрузкиОбъекта.Ошибки Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;
	
		Возврат;
		
	Иначе
		
		НеобходимыеДействия = РаботаСРезультатамиОбменаКлиент.НеобходимыеДействияПослеЗагрузкиОбъекта(ЭтотОбъект, РезультатЗагрузкиОбъекта);
		
		Если НеобходимыеДействия.ТребуетсяВыборНовойПроблемы Тогда
			
			ДанныеВозврата = РаботаСРезультатамиОбменаКлиент.ДанныеЗакрытияФормыПроблемыПослеЗагрузки(
				ЭтотОбъект,
				НеобходимыеДействия,
				Ложь,
				РезультатЗагрузкиОбъекта);
			
			Закрыть(ДанныеВозврата);
			Возврат;
			
		ИначеЕсли НеобходимыеДействия.ОбъектЗагружен
			И ОткрытьОбъектПослеЗагрузки Тогда
			ТребуетсяОткрытиеОбъекта = Истина;
		Иначе
			ТребуетсяОткрытиеОбъекта = Ложь;
		КонецЕсли;
		
		Если НеобходимыеДействия.ТребуетсяОбновлениеЭтойФормы Тогда
			РаботаСРезультатамиОбменаКлиент.ПоказатьОповещениеПроблемаНеИзменилась();
			ЗаполнитьДанныеФормы();
		ИначеЕсли НеобходимыеДействия.ТребуетсяПовторноеОткрытиеФормыПроблемы
			Или ТребуетсяОткрытиеОбъекта
			Или НеобходимыеДействия.ВыполненаУстановкаСоответствия
			Или НеобходимыеДействия.ТребуетсяЗакрытиеИВыводПредупреждения Тогда
			
			ДанныеВозврата = РаботаСРезультатамиОбменаКлиент.ДанныеЗакрытияФормыПроблемыПослеЗагрузки(
				ЭтотОбъект,
				НеобходимыеДействия,
				ТребуетсяОткрытиеОбъекта,
				РезультатЗагрузкиОбъекта);
			
			Закрыть(ДанныеВозврата);
			
		Иначе
			
			Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатЗагрузкиОбъекта(ДанныеОбъектаКОбработке)
	
	Возврат РаботаСРезультатамиОбмена.РезультатЗагрузкиОбъектаИзФормыПроблемы(ДанныеОбъектаКОбработке);

КонецФункции

#КонецОбласти
